Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G46A.tmx
Source language: en_us
Languages: zh_cn

source: A poet’s life
zh_cn: 诗人的一生

source: FEW knew what to make of Marianne Moore.
zh_cn: 玛丽安·穆尔是个什么样的人，没几个能搞得清。

source: By the time she died in 1972 she had been hailed as one of America’s greatest modernist poets.
zh_cn: 1972年她过世时，穆尔已被奉为美国最伟大的现代派诗人之一。

source: And yet her poetry puzzled most people.
zh_cn: 然而她的诗是大多数人都看不懂的。

source: A wave of 1970s feminist criticism ignored her.
zh_cn: 20世纪70年代时候刮起了对女权主义的批评风，没说到她。

source: Journalists preferred to characterise her as an eccentric spinster, fond of wearing a tricorne hat and cape.
zh_cn: 记者们爱把她说成是个古里古怪的老处女，一天到晚戴着个船形帽子，穿着个斗篷。

source: Even the poets who adored her found her strange and surprising.
zh_cn: 就是喜欢她的诗人也觉得她不是很和人亲近，很怪异。

source: William Carlos Williams, another poet, once remarked on hearing her laugh: “How slight a woman can so roar, like a secret Niagara.”
zh_cn: 另一位诗人William Carlos Williams 一次听到玛丽安·穆尔笑，说“一个女人（指穆尔）再怎么压低自己的大笑声音，也象隐藏的尼亚加拉河一样轰轰作响，让人心悸。”

source: “Holding On Upside Down” is the first authorised biography.
zh_cn: 《完全颠倒》是第一部经过授权的传记作品。

source: Linda Leavell, an American academic, was granted access to previously unseen archival documents and letters.
zh_cn: 美国学者Leavell获准可以接触到以前从未有人看到的档案文件和信件。

source: The result is a thorough examination of a remarkable life.
zh_cn: 结果就有了这本对玛丽安·穆尔出色一生的全面探究之作。

source: Moore was born in Missouri in 1887. Soon afterwards, her father was committed to a psychiatric hospital for religious mania (he later cut off his own hand, literally interpreting a passage from the Bible).
zh_cn: 1887年玛丽安·穆尔出生在密苏里州，出生不久她的父亲就因宗教的极端狂热而被强行送到了精神病院（后来他砍下了自己的一只手，说是圣经里这么说的）。

source: Her mother, Mary, moved Moore and her older brother, Warner, to Pennsylvania and embarked on a lesbian relationship with a woman called Mary Norcross for several years.
zh_cn: 穆尔的母亲带着她和她的长兄Warner搬到宾西法尼亚，在这里，母亲和一个名叫Mary Norcross的女人性有过几年的同性恋关系。

source: Seven years after graduating, Moore moved with her mother to New York; they lived together for the next 36 years.
zh_cn: 穆尔毕业后几年，玛丽安·穆尔和母亲搬去了纽约居住，这一住就是36年。

source: The Moores’ domestic life was claustrophobic.
zh_cn: 玛丽安·穆尔的家庭生活就象是幽禁。

source: Everything the poet wrote was read by her mother and scrutinised accordingly.
zh_cn: 诗人所写的一切东西，她母亲都要读一下，作出相应的修改。

source: Although she did not keep a diary, her life is well documented: when Moore was away from her mother she would send her detailed letters up to 150 pages long.
zh_cn: 尽管诗人不记日记，但她的生活却都被很好的记录下来：当穆尔不在母亲身边时，她会事无巨细都一一写在信上，告诉母亲，这些信共计达到了150页之多。

source: Warner regularly wrote to his mother and sister, so much so that he had to hide the fact from his jealous wife.
zh_cn: 她的哥哥也会给定期给母亲和妹妹写信，频繁到他得骗过自己的老婆，以免她妒忌。

source: They called each other nicknames after characters from “The Wind in the Willows”, a children’s book.
zh_cn: 他们用童书《柳林风声》中的人物来互称对方。

source: When literary figures came to call on Moore, it would often be her mother who did most of the talking.
zh_cn: 要是有文学界人物来拜访穆尔的话，往往大部分时候是她母亲在说，穆尔不怎么说话的。
